nrf-rs/nrf-pacs/svds/nrf52832.svd
        <register>
          <name>EXTREFSEL</name>
          <description>External reference select</description>
          <addressOffset>0x50C</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>EXTREFSEL</name>
              <description>External analog reference select</description>
              <lsb>0</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AnalogReference0</name>
                  <description>Use AIN0 as external analog reference</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AnalogReference1</name>
                  <description>Use AIN1 as external analog reference</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AnalogReference2</name>
                  <description>Use AIN2 as external analog reference</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AnalogReference3</name>
                  <description>Use AIN3 as external analog reference</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AnalogReference4</name>
                  <description>Use AIN4 as external analog reference</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AnalogReference5</name>
                  <description>Use AIN5 as external analog reference</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AnalogReference6</name>
                  <description>Use AIN6 as external analog reference</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AnalogReference7</name>
                  <description>Use AIN7 as external analog reference</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TH</name>
          <description>Threshold configuration for hysteresis unit</description>
          <addressOffset>0x530</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>THDOWN</name>
              <description>VDOWN = (THDOWN+1)/64*VREF</description>
              <lsb>0</lsb>
              <msb>5</msb>
            </field>
            <field>
              <name>THUP</name>
              <description>VUP = (THUP+1)/64*VREF</description>
              <lsb>8</lsb>
              <msb>13</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>MODE</name>
          <description>Mode configuration</description>
          <addressOffset>0x534</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>SP</name>
              <description>Speed and power modes</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Low</name>
                  <description>Low-power mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Normal</name>
                  <description>Normal mode</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>High</name>
                  <description>High-speed mode</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MAIN</name>
              <description>Main operation modes</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SE</name>
                  <description>Single-ended mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Diff</name>
                  <description>Differential mode</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>HYST</name>
          <description>Comparator hysteresis enable</description>
          <addressOffset>0x538</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>HYST</name>
              <description>Comparator hysteresis</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NoHyst</name>
                  <description>Comparator hysteresis disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Hyst50mV</name>
                  <description>Comparator hysteresis enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ISOURCE</name>
          <description>Current source select on analog input</description>
          <addressOffset>0x53C</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>ISOURCE</name>
              <description>Comparator hysteresis</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Off</name>
                  <description>Current source disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Ien2mA5</name>
                  <description>Current source enabled (+/- 2.5 uA)</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Ien5mA</name>
                  <description>Current source enabled (+/- 5 uA)</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Ien10mA</name>
                  <description>Current source enabled (+/- 10 uA)</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
