nrf-rs/nrf-pacs/svds/nrf52832.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="SWI0">
      <name>SWI1</name>
      <description>Software interrupt 1</description>
      <groupName>SWI</groupName>
      <baseAddress>0x40015000</baseAddress>
      <size>32</size>
      <interrupt>
        <name>SWI1_EGU1</name>
        <value>21</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="EGU0">
      <name>EGU1</name>
      <description>Event Generator Unit 1</description>
      <groupName>EGU</groupName>
      <baseAddress>0x40015000</baseAddress>
      <size>32</size>
      <alternatePeripheral>SWI1</alternatePeripheral>
      <interrupt>
        <name>SWI1_EGU1</name>
        <value>21</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="SWI0">
      <name>SWI2</name>
      <description>Software interrupt 2</description>
      <groupName>SWI</groupName>
      <baseAddress>0x40016000</baseAddress>
      <size>32</size>
      <interrupt>
        <name>SWI2_EGU2</name>
        <value>22</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="EGU0">
      <name>EGU2</name>
      <description>Event Generator Unit 2</description>
      <groupName>EGU</groupName>
      <baseAddress>0x40016000</baseAddress>
      <size>32</size>
      <alternatePeripheral>SWI2</alternatePeripheral>
      <interrupt>
        <name>SWI2_EGU2</name>
        <value>22</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="SWI0">
      <name>SWI3</name>
      <description>Software interrupt 3</description>
      <groupName>SWI</groupName>
      <baseAddress>0x40017000</baseAddress>
      <size>32</size>
      <interrupt>
        <name>SWI3_EGU3</name>
        <value>23</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="EGU0">
      <name>EGU3</name>
      <description>Event Generator Unit 3</description>
      <groupName>EGU</groupName>
      <baseAddress>0x40017000</baseAddress>
      <size>32</size>
      <alternatePeripheral>SWI3</alternatePeripheral>
      <interrupt>
        <name>SWI3_EGU3</name>
        <value>23</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="SWI0">
      <name>SWI4</name>
      <description>Software interrupt 4</description>
      <groupName>SWI</groupName>
      <baseAddress>0x40018000</baseAddress>
      <size>32</size>
      <interrupt>
        <name>SWI4_EGU4</name>
        <value>24</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="EGU0">
      <name>EGU4</name>
      <description>Event Generator Unit 4</description>
      <groupName>EGU</groupName>
      <baseAddress>0x40018000</baseAddress>
      <size>32</size>
      <alternatePeripheral>SWI4</alternatePeripheral>
      <interrupt>
        <name>SWI4_EGU4</name>
        <value>24</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="SWI0">
      <name>SWI5</name>
      <description>Software interrupt 5</description>
      <groupName>SWI</groupName>
      <baseAddress>0x40019000</baseAddress>
      <size>32</size>
      <interrupt>
        <name>SWI5_EGU5</name>
        <value>25</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="EGU0">
      <name>EGU5</name>
      <description>Event Generator Unit 5</description>
      <groupName>EGU</groupName>
      <baseAddress>0x40019000</baseAddress>
      <size>32</size>
      <alternatePeripheral>SWI5</alternatePeripheral>
      <interrupt>
        <name>SWI5_EGU5</name>
        <value>25</value>
      </interrupt>
    </peripheral>
    <peripheral>
      <name>TIMER3</name>
      <description>Timer/Counter 3</description>
      <groupName>TIMER</groupName>
      <baseAddress>0x4001A000</baseAddress>
      <size>32</size>
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>TIMER3</name>
        <value>26</value>
      </interrupt>
      <registers>
        <register>
          <name>TASKS_START</name>
          <description>Start Timer</description>
          <addressOffset>0x000</addressOffset>
          <access>write-only</access>
        </register>
        <register>
          <name>TASKS_STOP</name>
          <description>Stop Timer</description>
          <addressOffset>0x004</addressOffset>
          <access>write-only</access>
        </register>
        <register>
          <name>TASKS_COUNT</name>
          <description>Increment Timer (Counter mode only)</description>
          <addressOffset>0x008</addressOffset>
          <access>write-only</access>
        </register>
        <register>
          <name>TASKS_CLEAR</name>
          <description>Clear time</description>
          <addressOffset>0x00C</addressOffset>
          <access>write-only</access>
        </register>
        <register>
          <name>TASKS_SHUTDOWN</name>
          <description>Deprecated register -  Shut down timer</description>
          <addressOffset>0x010</addressOffset>
          <access>write-only</access>
        </register>
        <register>
          <dim>6</dim>
          <dimIncrement>4</dimIncrement>
          <name>TASKS_CAPTURE[%s]</name>
          <description>Description collection[0]:  Capture Timer value to CC[0] register</description>
          <addressOffset>0x040</addressOffset>
          <access>write-only</access>
        </register>
        <register>
          <dim>6</dim>
          <dimIncrement>4</dimIncrement>
          <name>EVENTS_COMPARE[%s]</name>
          <description>Description collection[0]:  Compare event on CC[0] match</description>
          <addressOffset>0x140</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>SHORTS</name>
          <description>Shortcut register</description>
          <addressOffset>0x200</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>COMPARE0_CLEAR</name>
              <description>Shortcut between COMPARE[0] event and CLEAR task</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable shortcut</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable shortcut</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COMPARE1_CLEAR</name>
              <description>Shortcut between COMPARE[1] event and CLEAR task</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable shortcut</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable shortcut</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COMPARE2_CLEAR</name>
              <description>Shortcut between COMPARE[2] event and CLEAR task</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable shortcut</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable shortcut</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COMPARE3_CLEAR</name>
              <description>Shortcut between COMPARE[3] event and CLEAR task</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable shortcut</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable shortcut</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COMPARE4_CLEAR</name>
              <description>Shortcut between COMPARE[4] event and CLEAR task</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable shortcut</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable shortcut</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COMPARE5_CLEAR</name>
              <description>Shortcut between COMPARE[5] event and CLEAR task</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable shortcut</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable shortcut</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COMPARE0_STOP</name>
              <description>Shortcut between COMPARE[0] event and STOP task</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable shortcut</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable shortcut</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COMPARE1_STOP</name>
              <description>Shortcut between COMPARE[1] event and STOP task</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable shortcut</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable shortcut</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COMPARE2_STOP</name>
              <description>Shortcut between COMPARE[2] event and STOP task</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable shortcut</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable shortcut</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COMPARE3_STOP</name>
              <description>Shortcut between COMPARE[3] event and STOP task</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable shortcut</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable shortcut</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COMPARE4_STOP</name>
              <description>Shortcut between COMPARE[4] event and STOP task</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable shortcut</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable shortcut</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COMPARE5_STOP</name>
              <description>Shortcut between COMPARE[5] event and STOP task</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable shortcut</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable shortcut</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>INTENSET</name>
          <description>Enable interrupt</description>
          <addressOffset>0x304</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>COMPARE0</name>
              <description>Write '1' to Enable interrupt for COMPARE[0] event</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Read: Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Read: Enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Set</name>
                  <description>Enable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COMPARE1</name>
              <description>Write '1' to Enable interrupt for COMPARE[1] event</description>
              <lsb>17</lsb>
              <msb>17</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Read: Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Read: Enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Set</name>
                  <description>Enable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COMPARE2</name>
              <description>Write '1' to Enable interrupt for COMPARE[2] event</description>
              <lsb>18</lsb>
              <msb>18</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Read: Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Read: Enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Set</name>
                  <description>Enable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COMPARE3</name>
              <description>Write '1' to Enable interrupt for COMPARE[3] event</description>
              <lsb>19</lsb>
              <msb>19</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Read: Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Read: Enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Set</name>
                  <description>Enable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COMPARE4</name>
              <description>Write '1' to Enable interrupt for COMPARE[4] event</description>
              <lsb>20</lsb>
              <msb>20</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Read: Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Read: Enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Set</name>
                  <description>Enable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COMPARE5</name>
              <description>Write '1' to Enable interrupt for COMPARE[5] event</description>
              <lsb>21</lsb>
              <msb>21</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Read: Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Read: Enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Set</name>
                  <description>Enable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
